shelly-tang/YareLampGo_esp32/ESP32_P4_HEAD/device_http.cpp
void DeviceHttp::finishUploadRequest(UploadKind kind) {
  const String phase = server_.header(kUploadPhaseHeader);
  if (phase.isEmpty()) {
    finishUpload(kind);
    return;
  }

  const HTTPRaw& raw = server_.raw();
  if (phase == "start") {
    if (raw.totalSize != 0) {
      uploadOk_ = false;
      uploadError_ = "start body must be empty";
    }
    if (!uploadOk_) {
      if (uploadFile_) uploadFile_.close();
      LittleFS.remove(uploadTempPath_);
      sendError(400, uploadError_.isEmpty() ? "cannot start asset upload" : uploadError_.c_str());
      return;
    }
    sendUploadProgress("started");
    return;
  }
  if (phase == "chunk") {
    if (raw.totalSize == 0) {
      uploadOk_ = false;
      uploadError_ = "asset chunk must not be empty";
    }
    if (!uploadOk_) {
      if (uploadFile_) uploadFile_.close();
      LittleFS.remove(uploadTempPath_);
      sendError(400, uploadError_.isEmpty() ? "asset chunk rejected" : uploadError_.c_str());
      return;
    }
    sendUploadProgress("chunk");
    return;
  }
  if (phase == "finish") {
    if (raw.totalSize != 0) {
      uploadOk_ = false;
      uploadError_ = "finish body must be empty";
    }
    if (!uploadOk_) {
      if (uploadFile_) uploadFile_.close();
      LittleFS.remove(uploadTempPath_);
      sendError(400, uploadError_.isEmpty() ? "asset upload failed" : uploadError_.c_str());
      return;
    }
    finishUpload(kind);
    return;
  }
  sendError(400, "invalid upload phase");
}

void DeviceHttp::startUpload(UploadKind kind, const String& assetId) {
  if (uploadFile_) uploadFile_.close();
  uploadKind_ = kind;
  uploadId_ = assetId;
  uploadTempPath_ = kind == UploadKind::kEye ? "/upload_eye.tmp" : "/upload_led.tmp";
  uploadBytes_ = 0;
  uploadOk_ = authorizeRequest() && ExpressionCoordinator::safeAssetId(uploadId_);
  uploadError_ = uploadOk_ ? "" : "unauthorized or invalid asset id";
  if (uploadOk_) {
    LittleFS.remove(uploadTempPath_);
    uploadFile_ = LittleFS.open(uploadTempPath_, "w");
  }
  if (uploadOk_ && !uploadFile_) {
    uploadOk_ = false;
    uploadError_ = "cannot open upload file";
  }
  Serial.printf("[HTTP UPLOAD] start kind=%s id=%s accepted=%d\n",
                kind == UploadKind::kEye ? "eye" : "led", uploadId_.c_str(), uploadOk_);
}

void DeviceHttp::appendUpload(UploadKind kind, const uint8_t* data, size_t size) {
  if (!uploadOk_) return;
  const size_t limit = kind == UploadKind::kEye ? kMaxEyeBytes : kMaxLedBytes;
  if (uploadBytes_ + size > limit || uploadFile_.write(data, size) != size) {
    uploadOk_ = false;
    uploadError_ = "asset exceeds limit or storage write failed";
    return;
  }
  uploadBytes_ += size;
}

void DeviceHttp::endUpload(UploadKind kind, bool aborted) {
  if (uploadFile_) uploadFile_.close();
  if (aborted) {
    uploadOk_ = false;
    uploadError_ = "upload aborted";
  }
  Serial.printf("[HTTP UPLOAD] end kind=%s bytes=%u ok=%d\n",
                kind == UploadKind::kEye ? "eye" : "led",
                static_cast<unsigned int>(uploadBytes_), uploadOk_);
}

void DeviceHttp::finishUpload(UploadKind kind) {
  if (kind != uploadKind_ || !uploadOk_) {
    LittleFS.remove(uploadTempPath_);
    sendError(400, uploadError_.isEmpty() ? "upload failed" : uploadError_.c_str());
    return;
  }
  if (uploadFile_) uploadFile_.close();
  String error;
  if (!validateStoredAsset(kind, uploadTempPath_, error)) {
    LittleFS.remove(uploadTempPath_);
    sendError(400, error.c_str());
    return;
  }
  const String destination = assetPath(kind, uploadId_);
  LittleFS.remove(destination);
  if (!LittleFS.rename(uploadTempPath_, destination)) {
    LittleFS.remove(uploadTempPath_);
    sendError(500, "cannot commit uploaded asset");
    return;
  }
  JsonDocument response;
  response["ok"] = true;
  response["action"] = "upload";
  response[kind == UploadKind::kEye ? "clip_id" : "effect_id"] = uploadId_;
  response["bytes"] = uploadBytes_;
  if (kind == UploadKind::kEye) response["display_confirmed"] = true;
  sendJson(200, response);
}

void DeviceHttp::sendUploadProgress(const char* action) {
  JsonDocument response;
  response["ok"] = true;
  response["action"] = action;
  sendJson(200, response);
}

void DeviceHttp::handleForgetWifi() {
  JsonDocument request;
  if (!parseJson(request)) return;
  if (!authorize(request.as<JsonObjectConst>())) {
    sendError(403, "pairing mismatch");
    return;
  }
  const String ownerId = pairing_.ownerId();
  const String pairingSecret = request["pairing_secret"] | "";
  Preferences preferences;
  if (!preferences.begin("lampgo-net", false)) {
    sendError(500, "cannot open WiFi settings");
    return;
  }
  const bool cleared = preferences.clear();
  preferences.end();
  if (!cleared) {
    sendError(500, "cannot clear WiFi settings");
    return;
  }
  if (!pairing_.unpair(ownerId, pairingSecret)) {
    sendError(500, "cannot clear pairing");
    return;
  }
  expressions_.stop();
  JsonDocument response;
  response["ok"] = true;
  response["restarting"] = true;
  sendJson(200, response);
  scheduleRestart();
}

void DeviceHttp::handleReboot() {
  JsonDocument request;
  if (!parseJson(request)) return;
  if (!authorize(request.as<JsonObjectConst>())) {
    sendError(403, "pairing mismatch");
    return;
  }
  JsonDocument response;
  response["ok"] = true;
  response["restarting"] = true;
  sendJson(200, response);
  scheduleRestart();
}

void DeviceHttp::handleServoStatus() {
  JsonDocument response;
  response["ok"] = true;
  addServoStatus(response["servos"].to<JsonObject>(), servos_.snapshot());
  sendJson(200, response);
}

bool DeviceHttp::parseJson(JsonDocument& document) {
  if (deserializeJson(document, server_.arg("plain")) || !document.is<JsonObject>()) {
    sendError(400, "invalid JSON body");
    return false;
  }
  return true;
}

bool DeviceHttp::authorize(JsonObjectConst body) const {
  return pairing_.authorize(body["owner_id"] | "", body["pairing_secret"] | "");
}

bool DeviceHttp::authorizeRequest() const {
  const String owner = server_.header(kOwnerHeader).isEmpty() ? server_.arg("owner") :
                                                              server_.header(kOwnerHeader);
  const String token = server_.header(kTokenHeader).isEmpty() ? server_.arg("token") :
                                                              server_.header(kTokenHeader);
  return pairing_.authorize(owner, token);
}

bool DeviceHttp::validateStoredAsset(UploadKind kind, const String& path, String& error) const {
  File file = LittleFS.open(path, "r");
  if (!file) {
    error = "uploaded asset is missing";
    return false;
  }
  char magic[6]{};
  const size_t magicSize = kind == UploadKind::kEye ? 6 : 4;
  if (file.readBytes(magic, magicSize) != magicSize ||
      (kind == UploadKind::kEye ? memcmp(magic, "LGLCD1", 6) : memcmp(magic, "LEF1", 4)) != 0) {
    error = "invalid asset magic";
    return false;
  }
  return true;
}

String DeviceHttp::assetPath(UploadKind kind, const String& id) const {
  return kind == UploadKind::kEye ? ExpressionCoordinator::eyePath(id) :
                                    ExpressionCoordinator::ledPath(id);
}

void DeviceHttp::sendJson(int status, JsonDocument& document) {
  String encoded;
  serializeJson(document, encoded);
  server_.sendHeader("Access-Control-Allow-Origin", "*");
  server_.send(status, "application/json", encoded);
}

void DeviceHttp::sendError(int status, const char* error) {
  JsonDocument response;
  response["ok"] = false;
  response["error"] = error;
  sendJson(status, response);
}

void DeviceHttp::scheduleRestart(uint32_t delayMs) {
  restartAtMs_ = millis() + delayMs;
}

void DeviceHttp::addServoStatus(JsonObject target, const ServoSnapshot& snapshot) const {
  target["startup_state"] = startupStateName(snapshot.startupState);
  target["recovery_reason"] = snapshot.recoveryReason;
  target["torque_enabled"] = snapshot.torqueEnabled;
  target["estopped"] = snapshot.estopped;
  target["profile_loaded"] = snapshot.profileLoaded;
  target["safety_clamp_count"] = snapshot.safetyClampCount;
  JsonArray motors = target["motors"].to<JsonArray>();
  for (uint8_t index = 0; index < BoardConfig::kServoCount; ++index) {
    JsonObject motor = motors.add<JsonObject>();
    motor["id"] = index + 1;
    motor["online"] = snapshot.online[index];
    motor["position"] = snapshot.position[index];
    motor["speed_raw"] = snapshot.speed[index];
    motor["load_raw"] = snapshot.load[index];
    motor["voltage_raw"] = snapshot.voltage[index];
    motor["temperature_raw"] = snapshot.temperature[index];
    motor["current_raw"] = snapshot.current[index];
  }
}
